Revit 2024 API
IFCOpeningData Class
 A class that contains opening data including extrusion data, opening solids and opening element id.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class IFCOpeningData : IDisposable
Visual Basic
Public Class IFCOpeningData _
	Implements IDisposable
Visual C++
public ref class IFCOpeningData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCOpeningData
See Also
IFCOpeningData Members
Autodesk.Revit.DB.IFC Namespace